import 'package:stac_core/stac_core.dart';
import 'profile_real_app_bar.dart';

@StacScreen(screenName: 'profile_real_rules')
StacWidget profileRealRules() {
  return StacScaffold(
    backgroundColor: '{{appColors.current.background.surface}}',
    appBar: buildProfileRealAppBar(title: 'Ù‚ÙˆØ§Ù†ÛŒÙ† Ùˆ Ù…Ù‚Ø±Ø±Ø§Øª'),
    body: StacSingleChildScrollView(
      padding: StacEdgeInsets.all(16),
      child: StacContainer(
        padding: StacEdgeInsets.all(14),
        decoration: StacBoxDecoration(
          color: '{{appColors.current.background.surface}}',
          borderRadius: StacBorderRadius.all(12),
          border: StacBorder.all(
            color: '{{appColors.current.input.borderEnabled}}',
            width: 1,
          ),
        ),
        child: StacText(
          data:
              'Ø´Ø±Ø§ÛŒØ· Ùˆ Ù…Ù‚Ø±Ø±Ø§Øª Ø§Ø±Ø§Ø¦Ù‡ Ø®Ø¯Ù…Ø§Øª ØªÙˆØ¨Ø§Ù†Ú©\n'
              'Û±- Ø­Ø¯ÙˆØ¯ Ù…Ø³Ø¦ÙˆÙ„ÛŒØª Ùˆ Ø´Ø±Ø§ÛŒØ· Ø¨Ø§Ù†Ú©\n'
              '''â€¢ Ù…Ø¨Ø§Ù„Øº Ø³ÙŠØ±Ø¯Ù‡ Ù‡Ø§Ù‰ Ù…Ø´ØªØ±ÙŠØ§Ù† Ø¯Ø± Ø¬Ø§Ø±Ø¬ÙˆØ¨ Ø¶ÙˆØ§Ø¨Ø· Ù‚Ø§Ù†ÙˆÙ†Ù‰ Ùˆ ØªØ§ Ø³Ù‚Ù Ù‚Ø§Ù†ÙˆÙ†Ù‰ ØªØ¹ÙŠÙŠÙ† Ø´Ø¯Ù‡ØŒ Ù…ÙˆØ±Ø¯ ØªØ¶Ù…ÙŠÙ† ØµÙ†Ø¯ÙˆÙ‚ Ø¶Ù…Ø§Ù†Øª Ø³ÙŠØ±Ø¯Ù‡ Ù‡Ø§Ù‰ Ø¨Ø§Ù†Ùƒ Ù…Ø±ÙƒØ²Ù‰ Ùˆ Ø¨Ø§Ù†Ùƒ ÙƒÙŽØ±Ø¯Ø´ÙƒÙŽØ±Ù‰ Ø§Ø³Øª.
â€¢ Ù‡Ù…Ù‡Ù‰ Ø§Ø·Ù„Ø§Ø¹Ø§Øª Ø­Ø³Ø§Ø¨ Ù‡Ø§ Ùˆ Ù…Ø¯Ø§Ø±Ùƒ Ù‡ÙˆÙŠØªÙ‰ Ù…Ø´ØªØ±ÙŠØ§Ù† Ù…Ø­Ø±Ù…Ø§Ù†Ù‡ Ø¨ÙˆØ¯Ù‡ Ùˆ Ø¨Ø§Ù†Ùƒ Ù…ØªØ¹Ù‡Ø¯ Ù…Ù‰ Ø´ÙˆØ¯ ØªØ­Øª Ù‡Ø± Ø´Ø±Ø§ÙŠØ·Ù‰ Ø¬Ø² Ø¯Ø± Ù…ÙˆØ§Ø±Ø¯ Ù…ØµØ±Ø­Ù‡ Ù‚Ø§Ù†ÙˆÙ†Ù‰ Ùˆ Ø¨Ø§ Ø¯Ø³ØªÙˆØ± Ù…Ø±Ø§Ø¬Ø¹ Ù‚Ø§Ù†ÙˆÙ†Ù‰ Ø§Ø²
Ø§ÙØ´Ø§ Ø¢Ù† Ø®ÙˆØ¯Ø¯Ø§Ø±Ù‰ Ù†Ù…Ø§ÙŠØ¯.
Ø³Ø§Ø¹Ø§Øª Ù¾Ø§Ø³Ø®ÙƒÙˆÙŠÙŠ
ØªÙˆØ¨Ø§Ù†ÙƒØŒ ÙŠÙƒ Ø¨Ø§Ù†Ùƒ Ù…Ù¢ Ø³Ø§Ø¹ØªÙ‡ Ø§Ø³Øª Ùˆ Ø¯Ø±Ù‡ÙŠØ¬ Ø±ÙˆØ² Ùˆ Ø³Ø§Ø¹ØªÙ‰ Ø§Ø² Ø³Ø§Ù„ØŒ ØªØ¹Ø·ÙŠÙ„Ù‰ Ù†Ø¯Ø§Ø±Ø¯. ØªÙ…Ø§Ù… Ø±ÙˆØ²Ù‡Ø§ Ùˆ ØªÙ…Ø§Ù… Ø³Ø§Ø¹Ø§Øª Ø´Ø¨Ø§Ù†Ù‡ Ø±ÙˆØ²ØŒ ØªÙˆØ¨Ø§Ù†Ùƒ Ø¨Ø§Ø² Ø§Ø³Øª.
â€¢ ØªÙˆØ¨Ø§Ù†Ùƒ Ø§Ø² Ø·Ø±ÙŠÙ‚ Ù…Ø±ÙƒØ² Ø§Ù…ÙˆØ± Ù…Ø´ØªØ±ÙŠØ§Ù† Ø¨Ø§ Ø´Ù…Ø§Ø±Ù‡ ØªÙ…Ø§Ø³
Ù¢Ù£Ù©Ù¥Ù  Ø¯Ø§Ø®Ù„Ù‰ Ù§ØŒ Ù…ÙˆØ¸Ù Ø¨Ù‡ Ù¾Ø§Ø³Ø®ÙƒÙŽÙˆÙŠÙ‰ Ø¨Ù‡ Ù…Ø´ØªØ±ÙŠØ§Ù†
Ù…Ø­ØªØ±Ù… Ù…Ù‰ Ø¨Ø§Ø´Ø¯.
ÙƒØ§Ø±Ù…Ø²Ø¯Ù‡Ø§
â€¢ ØªÙˆØ¨Ø§Ù†ÙƒØŒ ÙƒØ§Ø±Øª Ù‡Ø§Ù‰ Ø¨Ø§Ù†ÙƒÙ‰ Ø¯Ø±Ø®ÙˆØ§Ø³Øª Ø´Ø¯Ù‡ Ù…Ø´ØªØ±ÙŠØ§Ù† Ø±Ø§ Ø¨Ø±Ø§Ù‰ Ø¨Ø§Ø± Ø§ÙˆÙ„ØŒ Ø¨Ù‡ØµÙˆØ±Øª Ø±Ø§ÙŠÙƒØ§Ù† Ùˆ Ø¯Ø± ÙƒÙ…ØªØ±ÙŠÙ† Ø²Ù…Ø§Ù† Ù…Ù…ÙƒÙ† Ø¨Ù‡ Ø¯Ø³Øª Ù…Ø´ØªØ±ÙŠØ§Ù† Ù…Ù‰ Ø±Ø³Ø§Ù†Ø¯.
. ÙƒÙ„ÙŠÙ‡ Ù‡Ø²ÙŠÙ†Ù‡ Ù‡Ø§ ÙˆÙƒØ§Ø±Ù…Ø²Ø¯Ù‡Ø§Ù‰ Ù…Ø±ØªØ¨Ø· Ø¨Ø§ ÙØ±Ø§ÙŠÙ†Ø¯ Ø´Ù†Ø§Ø³Ø§ÙŠÙ‰ Ù…Ø´ØªØ±Ù‰ØŒ Ø§ÙØªØªØ§Ø­ Ø­Ø³Ø§Ø¨ØŒ ØµØ¯ÙˆØ± Ùˆ Ø§Ø±Ø³Ø§Ù„ ÙƒØ§Ø±Øª ØªÙˆØ³Ø· ØªÙˆØ¨Ø§Ù†Ùƒ Ù¾Ø±Ø¯Ø§Ø®Øª Ù…Ù‰ Ø´ÙˆØ¯ Ùˆ Ø®Ø¯Ù…Ø§Øª Ù…Ø°ÙƒÙˆØ± Ø¨Ø±Ø§Ù‰ Ù…Ø´ØªØ±ÙŠØ§Ù† Ù…Ø­ØªØ±Ù… Ø±Ø§ÙŠÙƒØ§Ù† Ø§Ø³Øª.''''Û±- Ø­Ø¯ÙˆØ¯ Ù…Ø³Ø¦ÙˆÙ„ÛŒØª Ùˆ Ø´Ø±Ø§ÛŒØ· Ø¨Ø§Ù†Ú©\n'
              'Ø§Ù…Ù†ÛŒØª Ø³Ù¾Ø±Ø¯Ù‡â€ŒÙ‡Ø§ Ùˆ ØªØ¶Ù…ÛŒÙ† Ù…Ø¨Ø§Ù„Øº Ù…Ø´ØªØ±ÛŒØ§Ù† Ø¯Ø± Ú†Ø§Ø±Ú†ÙˆØ¨ Ø¶ÙˆØ§Ø¨Ø· Ù‚Ø§Ù†ÙˆÙ†ÛŒ Ùˆ ØªØ¹Ù‡Ø¯Ø§Øª Ø¨Ø§Ù†Ú© Ø§Ù†Ø¬Ø§Ù… Ù…ÛŒâ€ŒØ´ÙˆØ¯.\n'
              'Û²- Ù…Ø­Ø±Ù…Ø§Ù†Ú¯ÛŒ Ø§Ø·Ù„Ø§Ø¹Ø§Øª\n'
              'Ù‡Ù…Ù‡ Ø§Ø·Ù„Ø§Ø¹Ø§Øª Ø­Ø³Ø§Ø¨â€ŒÙ‡Ø§ Ùˆ Ù…Ø¯Ø§Ø±Ú© Ù‡ÙˆÛŒØªÛŒ Ù…Ø´ØªØ±ÛŒØ§Ù† Ù…Ø­Ø±Ù…Ø§Ù†Ù‡ Ø¨ÙˆØ¯Ù‡ Ùˆ Ø¨Ø§Ù†Ú© Ø¬Ø² Ø¯Ø± Ù…ÙˆØ§Ø±Ø¯ Ù…ØµØ±Ø­ Ù‚Ø§Ù†ÙˆÙ†ÛŒ Ø§Ø² Ø§ÙØ´Ø§ÛŒ Ø¢Ù† Ø®ÙˆØ¯Ø¯Ø§Ø±ÛŒ Ù…ÛŒâ€ŒÙ†Ù…Ø§ÛŒØ¯.\n'
              'Û³- Ø³Ø§Ø¹Ø§Øª Ù¾Ø§Ø³Ø®Ú¯ÙˆÛŒÛŒ\n'
              'ØªÙˆØ¨Ø§Ù†Ú©ØŒ ÛŒÚ© Ø¨Ø§Ù†Ú© Û²Û´ Ø³Ø§Ø¹ØªÙ‡ Ø§Ø³Øª Ùˆ Ø¯Ø± Ù‡ÛŒÚ† Ø±ÙˆØ² Ùˆ Ø³Ø§Ø¹ØªÛŒ Ø§Ø² Ø³Ø§Ù„ ØªØ¹Ø·ÛŒÙ„ÛŒ Ù†Ø¯Ø§Ø±Ø¯. ØªÙ…Ø§Ù… Ø±ÙˆØ²Ù‡Ø§ Ùˆ ØªÙ…Ø§Ù… Ø³Ø§Ø¹Ø§Øª Ø´Ø¨Ø§Ù†Ù‡â€ŒØ±ÙˆØ²ØŒ ØªÙˆØ¨Ø§Ù†Ú© Ø¨Ø§Ø² Ø§Ø³Øª.\n'
              'Û´- Ù¾Ø´ØªÛŒØ¨Ø§Ù†ÛŒ Ù…Ø´ØªØ±ÛŒØ§Ù†\n'
              'ØªÙˆØ¨Ø§Ù†Ú© Ø§Ø² Ø·Ø±ÛŒÙ‚ Ù…Ø±Ú©Ø² Ø§Ù…ÙˆØ± Ù…Ø´ØªØ±ÛŒØ§Ù† Ø¨Ø§ Ø´Ù…Ø§Ø±Ù‡ ØªÙ…Ø§Ø³ Û²Û³Û¹ÛµÛ° Ø¯Ø§Ø®Ù„ÛŒ Û·ØŒ Ù…ÙˆØ¸Ù Ø¨Ù‡ Ù¾Ø§Ø³Ø®Ú¯ÙˆÛŒÛŒ Ø¨Ù‡ Ù…Ø´ØªØ±ÛŒØ§Ù† Ù…Ø­ØªØ±Ù… Ù…ÛŒâ€ŒØ¨Ø§Ø´Ø¯.\n\n'
              'Ûµ- Ù¾Ø°ÛŒØ±Ø´ Ù‚ÙˆØ§Ù†ÛŒÙ†\n'
              'Ø§Ø³ØªÙØ§Ø¯Ù‡ Ø§Ø² Ø®Ø¯Ù…Ø§Øª ØªÙˆØ¨Ø§Ù†Ú© Ø¨Ù‡ Ù…Ù†Ø²Ù„Ù‡ Ù…Ø·Ø§Ù„Ø¹Ù‡ Ùˆ Ù¾Ø°ÛŒØ±Ø´ Ú©Ø§Ù…Ù„ Ù‚ÙˆØ§Ù†ÛŒÙ† Ùˆ Ù…Ù‚Ø±Ø±Ø§Øª Ø§ÛŒÙ† Ø³Ø±ÙˆÛŒØ³ Ø§Ø³Øª.\n\n'
              'Ú©Ø§Ø±Ù…Ø²Ø¯Ù‡Ø§\n'
              'Ø¯Ø±Ø®ÙˆØ§Ø³Øªâ€ŒÙ‡Ø§ÛŒ Ø¨Ø§Ù†Ú©ÛŒ Ù…Ø´ØªØ±ÛŒØ§Ù† Ø¨Ø§ Ø´ÙØ§ÙÛŒØª Ú©Ø§Ù…Ù„ Ùˆ Ù…Ø·Ø§Ø¨Ù‚ ØªØ¹Ø±ÙÙ‡â€ŒÙ‡Ø§ÛŒ Ù…ØµÙˆØ¨ Ø§Ù†Ø¬Ø§Ù… Ø®ÙˆØ§Ù‡Ø¯ Ø´Ø¯.',
          textDirection: StacTextDirection.rtl,
          textAlign: StacTextAlign.right,
          style: StacCustomTextStyle(
            fontSize: 16,
            fontWeight: StacFontWeight.w500,
            color: '{{appColors.current.text.title}}',

          ),
        ),
      ),
    ),
  );
}
